app/views/students/show.html.erb

SELECT "student_classes".* FROM "student_classes" WHERE "student_classes"."student_id" = ?  [["student_id", 1]]
---

    <% @student_to_show.student_classes.each do |student_class| %>