app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
  def index
    @all_school_classes = SchoolClass.all

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Josh's Class"], ["room_number", 9], ["created_at", "2021-01-14 19:26:07.548847"], ["updated_at", "2021-01-14 19:26:07.548847"]]
---
  def create
    newly_created_school_class = SchoolClass.create(school_class_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @school_class_to_show = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @school_class_to_edit = SchoolClass.find(params[:id])

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "History is for squares"], ["updated_at", "2021-01-14 19:35:51.294294"], ["id", 1]]
---
  def update
    school_class_to_update = SchoolClass.find(params[:id])
    school_class_to_update.update(school_class_params(:title, :room_number))