app/controllers/student_classes_controller.rb

  def index
    @all_student_classes = StudentClass.all
---
SELECT "student_classes".* FROM "student_classes"

  def show
    @student_class_to_show = StudentClass.find(params[:id])
---
SELECT  "student_classes".* FROM "student_classes" WHERE "student_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @student_class_to_edit = StudentClass.find(params[:id])
---
SELECT  "student_classes".* FROM "student_classes" WHERE "student_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    student_class_to_update = StudentClass.find(params[:id])
    student_class_to_update.update(student_class_params(:student_id, :school_class_id, :current))
---
SELECT  "student_classes".* FROM "student_classes" WHERE "student_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "student_classes" SET "current" = ?, "updated_at" = ? WHERE "student_classes"."id" = ?  [["current", "f"], ["updated_at", "2021-01-14 20:38:27.127190"], ["id", 1]]

  def create
    newly_created_student_class = StudentClass.create(student_class_params(:student_id, :school_class_id))
    newly_created_student_class.update(current: true)
---
INSERT INTO "student_classes" ("student_id", "school_class_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 1], ["school_class_id", 2], ["created_at", "2021-01-14 20:20:27.931820"], ["updated_at", "2021-01-14 20:20:27.931820"]]
UPDATE "student_classes" SET "current" = ?, "updated_at" = ? WHERE "student_classes"."id" = ?  [["current", "t"], ["updated_at", "2021-01-14 20:20:27.935956"], ["id", 2]]

  def destroy
    @student_class_to_destroy = StudentClass.find(params[:id])
    @student_class_to_destroy.destroy
---
SELECT  "student_classes".* FROM "student_classes" WHERE "student_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "student_classes" WHERE "student_classes"."id" = ?  [["id", 1]]