app/controllers/students_controller.rb

  def create
    new_student = Student.create(student_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Alex"], ["last_name", "Marz"], ["created_at", "2021-01-14 18:26:52.229008"], ["updated_at", "2021-01-14 18:26:52.229008"]]

  def edit
    @student_to_edit = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    student_to_update = Student.find(params[:id])
    student_to_update.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jordy"], ["updated_at", "2021-01-14 18:49:05.627316"], ["id", 1]]

  def show
    @student_to_show = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def delete
    Student.destroy(params[:id])
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 3]]