app/views/student_classes/edit.html.erb

SELECT "students".* FROM "students"
SELECT "school_classes".* FROM "school_classes"
---

    <%= f.collection_select :student_id, Student.all, :id, :to_s %>
    <%= f.collection_select :school_class_id, SchoolClass.all, :id, :title %>