app/views/student_classes/new.html.erb

SELECT "students".* FROM "students"
SELECT "school_classes".* FROM "school_classes"
---
    <%= f.label :student_id, "Student ID" %>
    <%= f.collection_select :student_id, Student.all, :id, :to_s %>
    <%= f.label :school_class_id, "School Class ID" %>
    <%= f.collection_select :school_class_id, SchoolClass.all, :id, :title %>